#include <string>
#include <vector>

using namespace std;
// 칸 1개일 때 (1) -> 1가지
// 칸 2개일 때 (1, 1), (2) -> 2가지
// 칸 3개일 때 (1, 1, 1), (1, 2), (2, 1) -> 3가지
// 칸 4개일 때 (1, 1, 1, 1), (2, 1, 1), (1, 2, 1), (1, 1, 2), (2, 2) -> 5가지
// 칸 5개일 때 (1, 1, 1, 1, 1), (2, 1, 1, 1), (1, 2, 1, 1), (1, 1, 2, 1), (1, 1, 1, 2), (2, 2, 1), (2, 1, 2), (1, 2, 2) -> 8가지
// 피보나치 수열임
// arr[i] = arr[i-2] + arr[i-1]
long long solution(int n) {
    // n은 1이상 2000이하 정수
    long long arr[2001];

    arr[0] = 1;
    arr[1] = 1;
    for (int i = 2; i <= n; i++)
        arr[i] = (arr[i - 1] + arr[i - 2]) % 1234567;

    return arr[n];
}